diary/question2.org
* 喜多见系统 
* 【简单介绍】 
** 〔项目信息〕 
使用技术: SQL,C#-WinForm,SEP 
描述: 皮具代加工的订单管理，物料申购及采购管理，仓库管理，派工生产，流程控制及工资核算
** 〔个人角色〕
#+begin_src org
- 作为技术负责人中途接手
- 根据合同及需求进行系统设计(功能模块设计，数据库设计)，协助梳理客户需求，界定合同边界，业务逻辑设计，程序编码，迭代更新
- 除物联终端扫码枪中嵌入系统开发外的所有技术支持
#+end_src
* 【为何深刻】
** 〔缘由〕
#+begin_src org
- 我第一个顺利完成一期合同，客户觉得满意，又签了二期合同的项目
- 项目2015年07月启动，我是2015年09月接手。从2015年09月到2016年06月中间历时9个月，项目周期长，付出时间最多，很多次的熬夜加班
- 自己中途做为技术接手，并克服之前的困难项目顺利进行
- 痛点众多，很有挑战性，自身的能力得到快速成长 ，也得到客户的认可
#+end_src
** 〔痛点〕
1. 对方需求不确定，中途不断变更，界限不明，细节很多
2. 原材料多样 ,bom复杂
3. 系统各模块之间关联性强
4. 并发操作
5. 项目周期长 ，要控制成本
** 〔痛点解决方案〕
1. 基于文档进行沟通，用最小的功能解决对方最大的痛点，迭代更新
2. 对产品分级，对材料分类
3. 建立版本号和锁字段
4. 严格的事务控制
5. 减少团队规模，项目并发
* 【总结】
** 〔好的作用〕
#+begin_src org
- 遇到问题提出基于技术可供选择的解决方案
- 同时与客户及项目经理合作
- SQL性能调优
#+end_src
** 〔不完美的地方〕
- 界面传统，不够现代
- 有些不影响业务使用，但应该做控制的，限于工期和成本没有做限制
- 部分功能做到系统里更好，目前通过excel实现
** 〔一句话感悟〕
对项目要不放弃、乐观、有责任心，时刻进取，充满热情，相信团队合作的力量
