diary/question2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>question2</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="question2"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-07-21T14:42+0800"/>
<meta name="author" content="root"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">question2</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 * 【简单介绍】</a>
<ul>
<li><a href="#sec-1-1">1.1 〔项目信息〕</a></li>
<li><a href="#sec-1-2">1.2 〔个人角色〕</a></li>
</ul>
</li>
<li><a href="#sec-2">2 【为何深刻】</a>
<ul>
<li><a href="#sec-2-1">2.1 〔缘由〕</a></li>
<li><a href="#sec-2-2">2.2 〔痛点〕</a></li>
<li><a href="#sec-2-3">2.3 〔痛点解决方案〕</a></li>
</ul>
</li>
<li><a href="#sec-3">3 【总结】</a>
<ul>
<li><a href="#sec-3-1">3.1 〔好的作用〕</a></li>
<li><a href="#sec-3-2">3.2 〔不完美的地方〕</a></li>
<li><a href="#sec-3-3">3.3 〔一句话感悟〕</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> * 【简单介绍】</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 〔项目信息〕</h3>
<div class="outline-text-3" id="text-1-1">

<p>使用技术: SQL,C#-WinForm,SEP 
描述: 皮具代加工的订单管理，物料申购及采购管理，仓库管理，派工生产，流程控制及工资核算
</p></div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 〔个人角色〕</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-org">- &#20316;&#20026;&#25216;&#26415;&#36127;&#36131;&#20154;&#20013;&#36884;&#25509;&#25163;
- &#26681;&#25454;&#21512;&#21516;&#21450;&#38656;&#27714;&#36827;&#34892;&#31995;&#32479;&#35774;&#35745;(&#21151;&#33021;&#27169;&#22359;&#35774;&#35745;&#65292;&#25968;&#25454;&#24211;&#35774;&#35745;)&#65292;&#21327;&#21161;&#26803;&#29702;&#23458;&#25143;&#38656;&#27714;&#65292;&#30028;&#23450;&#21512;&#21516;&#36793;&#30028;&#65292;&#19994;&#21153;&#36923;&#36753;&#35774;&#35745;&#65292;&#31243;&#24207;&#32534;&#30721;&#65292;&#36845;&#20195;&#26356;&#26032;
- &#38500;&#29289;&#32852;&#32456;&#31471;&#25195;&#30721;&#26538;&#20013;&#23884;&#20837;&#31995;&#32479;&#24320;&#21457;&#22806;&#30340;&#25152;&#26377;&#25216;&#26415;&#25903;&#25345;
</pre>

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 【为何深刻】</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 〔缘由〕</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="src src-org">- &#25105;&#31532;&#19968;&#20010;&#39034;&#21033;&#23436;&#25104;&#19968;&#26399;&#21512;&#21516;&#65292;&#23458;&#25143;&#35273;&#24471;&#28385;&#24847;&#65292;&#21448;&#31614;&#20102;&#20108;&#26399;&#21512;&#21516;&#30340;&#39033;&#30446;
- &#39033;&#30446;2015&#24180;07&#26376;&#21551;&#21160;&#65292;&#25105;&#26159;2015&#24180;09&#26376;&#25509;&#25163;&#12290;&#20174;2015&#24180;09&#26376;&#21040;2016&#24180;06&#26376;&#20013;&#38388;&#21382;&#26102;9&#20010;&#26376;&#65292;&#39033;&#30446;&#21608;&#26399;&#38271;&#65292;&#20184;&#20986;&#26102;&#38388;&#26368;&#22810;&#65292;&#24456;&#22810;&#27425;&#30340;&#29100;&#22812;&#21152;&#29677;
- &#33258;&#24049;&#20013;&#36884;&#20570;&#20026;&#25216;&#26415;&#25509;&#25163;&#65292;&#24182;&#20811;&#26381;&#20043;&#21069;&#30340;&#22256;&#38590;&#39033;&#30446;&#39034;&#21033;&#36827;&#34892;
- &#30171;&#28857;&#20247;&#22810;&#65292;&#24456;&#26377;&#25361;&#25112;&#24615;&#65292;&#33258;&#36523;&#30340;&#33021;&#21147;&#24471;&#21040;&#24555;&#36895;&#25104;&#38271; &#65292;&#20063;&#24471;&#21040;&#23458;&#25143;&#30340;&#35748;&#21487;
</pre>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 〔痛点〕</h3>
<div class="outline-text-3" id="text-2-2">

<ol>
<li>对方需求不确定，中途不断变更，界限不明，细节很多
</li>
<li>原材料多样 ,bom复杂
</li>
<li>系统各模块之间关联性强
</li>
<li>并发操作
</li>
<li>项目周期长 ，要控制成本
</li>
</ol>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 〔痛点解决方案〕</h3>
<div class="outline-text-3" id="text-2-3">

<ol>
<li>基于文档进行沟通，用最小的功能解决对方最大的痛点，迭代更新
</li>
<li>对产品分级，对材料分类
</li>
<li>建立版本号和锁字段
</li>
<li>严格的事务控制
</li>
<li>减少团队规模，项目并发
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 【总结】</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 〔好的作用〕</h3>
<div class="outline-text-3" id="text-3-1">




<pre class="src src-org">- &#36935;&#21040;&#38382;&#39064;&#25552;&#20986;&#22522;&#20110;&#25216;&#26415;&#21487;&#20379;&#36873;&#25321;&#30340;&#35299;&#20915;&#26041;&#26696;
- &#21516;&#26102;&#19982;&#23458;&#25143;&#21450;&#39033;&#30446;&#32463;&#29702;&#21512;&#20316;
- SQL&#24615;&#33021;&#35843;&#20248;
</pre>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 〔不完美的地方〕</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>界面传统，不够现代
</li>
<li>有些不影响业务使用，但应该做控制的，限于工期和成本没有做限制
</li>
<li>部分功能做到系统里更好，目前通过excel实现
</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 〔一句话感悟〕</h3>
<div class="outline-text-3" id="text-3-3">

<p>对项目要不放弃、乐观、有责任心，时刻进取，充满热情，相信团队合作的力量
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-07-21T14:42+0800</p>
<p class="author">Author: root</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
